tap "argoproj/tap"
tap "aws/tap"
tap "common-fate/granted"
tap "cue-lang/tap"
tap "danielfoehrkn/switch"
tap "helm/tap"
tap "homebrew/services"
tap "iann0036/iamlive"
tap "localstack/tap"
tap "rad-security/tap", "https://github.com/rad-security/homebrew-tap.git"
# Run your GitHub Actions locally
brew "act"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Browser automation CLI for AI agents
brew "agent-browser"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Hosting Helm Charts via GitHub Pages and Releases
brew "chart-releaser"
# XML 1.0 parser
brew "expat", link: true
# Testing and linting Helm charts
brew "chart-testing"
# GNU compiler collection
brew "gcc"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Lint commit messages according to a commit convention
brew "commitlint"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Program that can automate interactive applications
brew "expect"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Firebase command-line tools
brew "firebase-cli"
# Open-source alternative to the OpenGL Utility Toolkit (GLUT) library
brew "freeglut"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Packet sniffer for displaying and logging HTTP traffic
brew "httpry"
# Configurable static site generator
brew "hugo"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Input filter for the pager less
brew "lesspipe"
# Minify and secure Docker images
brew "mintoolkit"
# Utility for managing network connections
brew "netcat"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# File browser
brew "ranger"
# Docker and OCI Registry Client in Go and tooling using those libraries
brew "regclient"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Rust toolchain installer
brew "rustup"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Work with remote images registries
brew "skopeo"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Tools for building Android applications
cask "android-studio"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Terminal-based AI coding assistant
cask "claude-code"
# C and C++ IDE
cask "clion"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to hide status bar icons
cask "dozer"
# Screen colour temperature controller
cask "flux-app"
cask "font-fira-code-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Native desktop AI assistant from Google
cask "google-gemini"
# Grammarly for desktop
cask "grammarly-desktop"
# Tool to set light or dark appearance on a per-app basis
cask "gray"
# Utility to hide menu bar items
cask "hiddenbar"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Enable generative AI features in iTerm2
cask "itermai"
# Keyboard customiser
cask "karabiner-elements"
# Kubernetes IDE
cask "lens"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# PDF editor
cask "master-pdf-editor"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to extend trackpad functionality
cask "middleclick"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# IDE for professional Python development
cask "pycharm"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# StrongDM client
cask "sdm"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Quick Look plugin for webp files
cask "webpquicklook"
# Collection of machine learning algorithms for data mining tasks
cask "weka"
# Tool that provides commands for working with selected text
cask "wordservice"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fnando.linter"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "gurumukhi.selected-lines-count"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "jock.svg"
vscode "kddejong.vscode-cfn-lint"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tim-koehler.helm-intellisense"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "ziyasal.vscode-open-in-github"
go "golang.org/x/tools/gopls"
uv "dstack"
krew "starboard"
npm "agent-browser"
npm "corepack"
npm "mcp-remote"
